#pragma once

#define MIRROR_USER_AGREEMENT   \
    _T("使用须知\r\n") \
    _T("这个软件是一个绿色的，免费的软件。\r\n") \
    _T("所有和这个软件相关的信息，都将保存在和软件相同目录下的ini文件中。\r\n") \
    _T("写这个软件的目的，只是为了方便Windows开发人员更加方便的进行和窗口相关的开发。\r\n") \
    _T("本软件并不想用于盈利和其他用途，所以请认真阅读以下协议，我也会尽量保证协议精简。\r\n") \
    _T("==================================================================\r\n") \
    _T("最终用户使用协议\r\n") \
    _T("使用本软件时，您可以：\r\n") \
    _T("1.使用本软件提供的任何功能。\r\n") \
    _T("2.在任意网站上发布本软件，或以任何形式传播本软件。\r\n") \
    _T("\r\n") \
    _T("您不可以：\r\n") \
    _T("1.在未经过作者许可下，对本软件进行任何形式的修改。\r\n") \
    _T("2.将其当作商业软件来发布。\r\n") \
    _T("3.使用本软件来进行任何不正当行为。\r\n") \
    _T("==================================================================\r\n") \
    _T("免责声明\r\n") \
    _T("使用本软件是您的个人行为，造成的任何后果，都与作者无关。\r\n")